description_create_user = """
Создается временная учетная, которая хранится в кэше. 
Так же на адрес электронной почты пользователя отправляется
письмо для завершения процесса регистрации. 
Запись хранится в течение ограниченного времени. 
Эта запись будет использована, если пользователь подтвердит 
электронный почтовый адрес для завершения регистрации пользователя."""

description_registration_user = """
Окончательная процедура регистрации пользователя в Сервисе, данный метод вызывается после
`create_user`. Подразумевается что в headers Authorization указан токен который
 был отправлен пользователю по электронной почте. В случае успешной проверки 
Создается учетная запись в Базе данных, выдаются токены доступа.
пользователь может пользователя сервисом в пределах своей роли.
"""
